MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MCXC142VFM/mcu.h
#define BTSERR                        0x00000080      // Bit Stuff Error Interrupt
#define DMAERR                        0x00000020      // DMA Error Interrupt
#define BTOERR                        0x00000010      // Bus Turnaround Timeout Error Interrupt
#define DFN8                          0x00000008      // Data Field Not 8 Bits Interrupt
#define CRC16                         0x00000004      // CRC16 Error Interrupt
#define CRC5                          0x00000002      // CRC5 Error Interrupt
#define PIDERR                        0x00000001      // PID Check Failure Interrupt


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_ERREN register.
//
//*****************************************************************************

#define BTSERREN                      0x00000080      // Bit Stuff Error Interrupt Enable
#define DMAERREN                      0x00000020      // DMA Error Interrupt Enable
#define BTOERREN                      0x00000010      // Bus Turnaround Timeout Error Interrupt Enable
#define DFN8EN                        0x00000008      // Data Field Not 8 Bits Interrupt Enable
#define CRC16EN                       0x00000004      // CRC16 Error Interrupt Enable
#define CRC5EOFEN                     0x00000002      // CRC5/EOF Error Interrupt Enable
#define PIDERREN                      0x00000001      // PID Check Failure Interrupt Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_STAT register.
//
//*****************************************************************************

#define ENDP                          0x00000780      // Endpoint Address
#define TX                            0x00000008      // Transmit Indicator
#define ODD                           0x00000004      // Odd Bank Indicator


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_CTL register.
//
//*****************************************************************************

#define JSTATE                        0x00000080      // Live USB differential receiver JSTATE signal
#define SE0                           0x00000040      // Live USB Single Ended Zero signal
#define TXSUSPENDTOKENBUSY            0x00000020      // TXD_SUSPEND is set when the SIE has disabled packet transmission and reception
#define RESUME                        0x00000004      // Resume Signaling Enable
#define ODDRST                        0x00000002      // Odd Bank Reset
#define USBENSOFEN                    0x00000001      // USB Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_ADDR register.
//
//*****************************************************************************

#define ADDR                          0x00001FC0      // USB Address


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_BDTPAGE1 register.
//
//*****************************************************************************

#define BDTBA                         0x00007F80      // BDT Base Address


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_FRMNUML register.
//
//*****************************************************************************

#define FRM[7:0]                      0x00007F80      // Frame Number


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_FRMNUMH register.
//
//*****************************************************************************

#define FRM[10:8]                     0x0000001C      // Frame Number
#define FRM[10:8]                     0x00000004      // This 3-bit field and the 8-bit field in the Frame Number Register Low are used to compute the address where the current Buffer Descriptor Table (BDT) resides in system memory.


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_BDTPAGE2 register.
//
//*****************************************************************************

#define BDTBA                         0x00000080      // Provides address bits 23 through 16 of the BDT base address that defines the location of Buffer Descriptor Table resides in system memory.


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_BDTPAGE3 register.
//
//*****************************************************************************

#define BDTBA                         0x00000080      // Provides address bits 31 through 24 of the BDT base address that defines the location of Buffer Descriptor Table resides in system memory.


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_ENDPTn register.
//
//*****************************************************************************

#define EPCTLDIS                      0x00000010      // This bit, when set, disables control (SETUP) transfers. When cleared, control transfers are enabled. This applies if and only if the EPRXEN and EPTXEN bits are also set. See Table 37-7
#define EPRXEN                        0x00000008      // This bit, when set, enables the endpoint for RX transfers. See Table 37-7
#define EPTXEN                        0x00000004      // This bit, when set, enables the endpoint for TX transfers. See Table 37-7
#define EPSTALL                       0x00000002      // When set this bit indicates that the endpoint is stalled. This bit has priority over all other control bits in this register, but it is only valid if EPTXEN=1 or EPRXEN=1. Any access to this endpoint causes the USB Module to return a STALL handshake. After an endpoint is stalled it requires intervention from the Host Controller.
#define EPHSHK                        0x00000001      // When set this bit enables an endpoint to perform handshaking during a transaction to this endpoint. This bit is generally 1 unless the endpoint is Isochronous.


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_USBCTRL register.
//
//*****************************************************************************

#define SUSP                          0x00000080      // Places the USB transceiver into the suspend state.;; 0: USB transceiver is not in suspend state;; 1: USB transceiver is in suspend state.
#define PDE                           0x00000040      // Enables the weak pulldowns on the USB transceiver.;; 0: Weak pulldowns are disabled on D+ and D;; 1: Weak pulldowns are enabled on D+ and D


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_OBSERVE register.
//
//*****************************************************************************

#define DPPU                          0x00000080      // Provides observability of the D+ Pullup signal output from USB.;; 0: D+ pullup disabled;; 1: D+ pullup enabled.
#define DPPD                          0x00000040      // Provides observability of the D+ Pulldown signal output from USB.;; 0: D+ pulldown disabled;; 1: D+ pulldown enabled.
#define DMPD                          0x00000010      // Provides observability of the D- Pulldown signal output from USB.;; 0: D pulldown disabled;; 1: D pulldown enabled.


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_CONTROL register.
//
//*****************************************************************************

#define DPPULLUPNONOTG                0x00000010      // Provides control of the DP Pullup in USB, if USB is configured in non-OTG device mode.;; 0: DP Pullup in non-OTG device mode is not enabled;; 1: DP Pullup in non-OTG device mode is enabled.


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_USBTRC0 register.
//
//*****************************************************************************

#define USBRESET                      0x00000080      // Generates a hard reset to USB. After this bit is set and the reset occurs, this bit is automatically cleared.;; 0: Normal USB module operation;; 1: Returns the USB module to its reset state.
#define USBRESMEN                     0x00000020      // Asynchronous Resume Interrupt Enable.;; 0: USB asynchronous wakeup from suspend mode disabled;; 1: USB asynchronous wakeup from suspend mode enabled.
#define USB_CLK_RECOVERY_INT          0x00000004      // Combined USB Clock Recovery interrupt status.;; 0: No interrupt was generated;; 1: Interrupt was generated
#define SYNC_DET                      0x00000002      // Synchronous USB Interrupt Detect.;; 0: Synchronous interrupt has not been detected;; 1: Synchronous interrupt has been detected.
#define USB_RESUME_INT                0x00000001      // USB Asynchronous Interrupt.;; 0: No interrupt was generated;; 1: Interrupt was generated because of the USB asynchronous interrupt.


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_USBFRMADJUST register.
//
//*****************************************************************************

#define ADJ                           0x00000080      // Frame Adjustment.;; In Host mode, the frame adjustment is a twos complement number that adjusts the period of each USB frame in 12-MHz clock periods.


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_KEEP_ALIVE_CTRL register.
//
//*****************************************************************************

#define WAKE_INT_STS                  0x00000080      // Wakeup Interrupt Status.;; If KEEP_ALIVE mode is enabled and a SETUP token or software assigned token is received, this interrupt is set only when the token is processed and the USB state is IDLE. Reset to 0. Software read only, and write 1 to clear.
#define WAKE_INT_EN                   0x00000010      // Wakeup Interrupt Enable.;; 0: Wakeup interrupt disabled;; 1: Wakeup interrupt enabled.
#define AHB_DLY_EN                    0x00000008      // Must be set to 1 to delay the first USB AHB bus transfer until after the USB has exited KEEP_ALIVE mode.;; 0: Do not delay the USB AHB transfer if the USB AHB transfer occurs while exiting KEEP_ALIVE mode;; 1: Delay the USB AHB transfer until the clock is recovered, if the USB AHB transfer occurs while exiting KEEP_ALIVE mode.
#define STOP_ACK_DLY_EN               0x00000004      // When set to 1, will respond the ipg_stop when usb core state is idle and no AHB transfer; when set to 0, will respond the ipg_stop when no AHB transfer.;; 0: Enter and exit KEEP_ALIVE mode until the USB core is idle and there is no USB AHB transfer;; 1: Enter and exit KEEP_ALIVE mode immediately when there is no USB AHB transfer.
#define OWN_OVERRD_EN                 0x00000002      // When set to 1, during KEEP_ALIVE mode, if received token is not SETUP, the OWN bit of current BD will be forced to 0, so usb core will response with NAK.;; 0: OWN bit of current BD will not be forced to 0;; 1: OWN bit of current BD will be forced to 0.
#define KEEP_ALIVE_EN                 0x00000001      // Global enable for USB_KEEP_ALIVE mode. When assert, usb shall enter USB_KEEP_ALIVE mode after asserting ipg_stop; when de-assert, everything is same as before.;; 0: USB_KEEP_ALIVE mode disabled;; 1: USB_KEEP_ALIVE mode enabled.


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_KEEP_ALIVE_WKCTRL register.
//
//*****************************************************************************

#define WAKE_ON_THIS                  0x00000008      // Software configure it to which token can wakeup usb during KEEP_ALIVE mode.;; 0001: Wake up on receiving OUT/SETUP token packet;; 1101: Wake up on receiving SETUP token packet.


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_CLK_RECOVER_CTRL register.
//
//*****************************************************************************

#define CLOCK_RECOVER_EN              0x00000080      // Crystal-less USB enable.;; 0: Disable clock recovery block;; 1: Enable clock recovery block.
#define RESET_ROUGH_EN                0x00000040      // Reset/resume to rough phase enable.;; 0: Always works in tracking phase after the first time rough to track transition;; 1: Go back to rough stage whenever bus reset or bus resume occurs.
#define RESTART_IFRTRIM_EN            0x00000020      // Restart from IFR trim value.;; 0: Trim fine adjustment always works based on the previous updated trim fine value;; 1: Trim fine restarts from the IFR trim value whenever bus_reset/bus_resume is detected or module enable is desasserted.


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_CLK_RECOVER_IRC_EN register.
//
//*****************************************************************************

#define IRC_EN                        0x00000002      // IRC48M enable.;; 0: Disable the IRC48M module;; 1: Enable the IRC48M module.


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_CLK_RECOVER_INT_EN register.
//
//*****************************************************************************

